{
    "general": {
        "website": "kotlinskidev.pl"
    },
    "header": {
        "about": "About me",
        "myprofile": "My Profile",
        "projects": "Projects",
        "stack": "Stack",
        "contact": "Contact",
        "login": "Sign In",
        "home" : "Home",
        "cv": "Curriculum Vitae",
        "settings" : "Settings",
        "language": "Language",
        "pages": {
            "carrier_plc": "PLC programmer career",
            "carrier_front": "Front-end developer career",
            "courses": "Training, courses",
            "education": "Education",
            "software_enginner": "Front-End Development",
            "automation_enginner": "Automation Engineer"
        },
        "notification": {
            "header": "Message",
            "text": "The website is under construction, some functionalities may not be available yet. Sorry for the momentary difficulties and lack of all content, I'm working on it :)"
        }
    },
    "typedText": {
        "text1": "Welcome on my webstie!",
        "text2": "This page is still in working...",
        "text3": "Be patient, sonn it will be ready! :)"
    },
    "footer":{
        "cookie_consent": {
            "first_text" : "This website uses cookies to enhance the user experience.",
            "second_text": "Accept cookies policy to get better experience!",
            "buttonText": "Accept Cookies",
            "declineButtonText": "I decline"
        },
        "privacy":{
            "rights": "https://kotlinskidev.pl - All right reserved.",
            "policy": "Privacy policy & processing personal data",
            "cookies": "Cookies policy"
        },
        "pages": {
            "services": "Services",
            "contact": "Contact",
            "web": "Web development",
            "shopify": "Shopify development",
            "plc": "PLC programming"
        }
    },
    "not_found": {
        "header": "I couldn't find what you were looking for.",
        "paragraph_reason": "Unfortunately the page you were looking for could not be found. It may be temporarily unavailable, moved or no longer exist.",
        "paragraph_todo": "Check the URL you entered for any mistakes and try again. Alternatively, search for whatever is missing or take a look around the rest of my site.",
        "search_placeholder": "Search.."
    },
    "pages": {
        "home": {
            "welcome": {
                "header": "Adrian Kotliński",
                "title": "Junior Front-end Developer",
                "scroll": "Scroll down"
            },
            "about": {
                "header": "Hello",
                "text": "My name is Adrian Kotlinski, I live in Katowice. I started my adventure with FrontEnd at the end of 2020. Since then, I have devoted every free moment to learning and it gives me great pleasure. I constantly strive to expand my competences by learning about the latest solutions and technologies.",
                "seemore": "Explore more"
            },
            "categories": {
                "header": "I invite you to visit also the other pages..",
                "about": "About me",
                "projects": "Projects",
                "stack": "Stack",
                "services": "Services"
            }
        },
        "privacy": {
            "header": "Privacy Policy",
            "update": "Last updated: May 19, 2021",
            "describe": "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.",
            "personal_data": "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy. This Privacy Policy has been created with the help of the ",
            "generator": "Privacy Policy Generator",
            "interpretation": "Interpretation and Definitions",
            "interpretation_header": "Interpretation",
            "interpretation_text": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.",
            "definitions": {
                "header": "Definitions",
                "text": "For the purposes of this Privacy Policy:",
                "account_title": "Account",
                "account_label": " means a unique account created for You to access our Service or parts of our Service.",
                "company_title": "Company",
                "company_label": " (referred to as either 'the Company', 'We', 'Us' or 'Our' in this Agreement) refers to kotlinskidev",
                "cookies_title": "Cookies",
                "cookies_label": " are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.",
                "country_title": "Country",
                "country_label": " refers to: Poland",
                "device_title": "Device",
                "device_label": " means any device that can access the Service such as a computer, a cellphone or a digital tablet.",
                "personal_title": "Personal Data",
                "personal_label": " is any information that relates to an identified or identifiable individual.",
                "service_title": "Service",
                "service_label": " refers to the Website.",
                "service_provider_title": "Service Provider",
                "service_provider_label": " means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.",
                "social_title": "Third-party Social Media Service",
                "social_label": " refers to any website or any social network website through which a User can log in or create an account to use the Service.",
                "usage_title": "Usage Data",
                "usage_label": " refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).",
                "website_title": "Website",
                "website_label": " refers to kotlinskidev, accessible from ",
                "website_link": "https://www.kotlinskidev.pl",
                "you_title": "You",
                "you_label": " means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable."
            },
            "collecting_data":{
                "header": "Collecting and Using Your Personal Data",
                "text": "Types of Data Collected",
                "personal": {
                    "header": "Personal Data",
                    "text": "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:",
                    "email": "Email address",
                    "name": "First name and last name",
                    "phone": "Phone number",
                    "address": "Address, State, Province, ZIP/Postal code, City",
                    "usage": "Usage Data"
                },
                "usage": {
                    "header": "Usage Data",
                    "collection": "Usage Data is collected automatically when using the Service.",
                    "include": "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.",
                    "access": "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.",
                    "collect": "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device."
                },
                "third": {
                    "header": "Information from Third-Party Social Media Services",
                    "text": "The Company allows You to create an account and log in to use the Service through the following Third-party Social Media Services:",
                    "google": "Google",
                    "facebook": "Facebook",
                    "twitter": "Twitter",
                    "register": "If You decide to register through or otherwise grant us access to a Third-Party Social Media Service, We may collect Personal data that is already associated with Your Third-Party Social Media Service's account, such as Your name, Your email address, Your activities or Your contact list associated with that account.",
                    "additional": "You may also have the option of sharing additional information with the Company through Your Third-Party Social Media Service's account. If You choose to provide such information and Personal Data, during registration or otherwise, You are giving the Company permission to use, share, and store it in a manner consistent with this Privacy Policy."
                },
                "tracking": {
                    "header": "Tracking Technologies and Cookies",
                    "cookies": "We use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:",
                    "cookies_title": "Cookies or Browser Cookies.",
                    "cookies_text": "A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service. Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies.",
                    "flash_title": "Flash Cookies.",
                    "flash_text": "Certain features of our Service may use local stored objects (or Flash Cookies) to collect and store information about Your preferences or Your activity on our Service. Flash Cookies are not managed by the same browser settings as those used for Browser Cookies. For more information on how You can delete Flash Cookies, please read 'Where can I change the settings for disabling, or deleting local shared objects?' available at", 
                    "flash_link" : "https://helpx.adobe.com/flash-player/kb/disable-local-shared-objects-flash.html#main_Where_can_I_change_the_settings_for_disabling__or_deleting_local_shared_objects_",
                    "beacons_title": "Web Beacons.",
                    "beacons_text": "Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity).",
                    "persistent": "Cookies can be 'Persistent' or 'Session' Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies:",
                    "what_cookies_are": "What Are Cookies?",
                    "session": "We use both Session and Persistent Cookies for the purposes set out below:",
                    "necessary": "Necessary / Essential Cookies",
                    "type": "Type: Session Cookies",
                    "administered": "Administered by: Us",
                    "purpose": "Purpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.",
                    "cookies_policy": "Cookies Policy / Notice Acceptance Cookies",
                    "cookies_policy_type": "Type: Persistent Cookies",
                    "cookies_policy_administered": "Administered by: Us",
                    "cookies_purpose": "Purpose: These Cookies identify if users have accepted the use of cookies on the Website.",
                    "cookies_functionality": "Functionality Cookies",
                    "cookies_functionality_type": "Type: Persistent Cookies",
                    "cookies_functionality_administered": "Administered by: Us",
                    "cookies_website": "Purpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.",
                    "more": "For more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy."
                },
                "use_personal": {
                    "header": "Use of Your Personal Data",
                    "text": "The Company may use Personal Data for the following purposes:",
                    "service_title": "To provide and maintain our Service",
                    "service_text": ", including to monitor the usage of our Service.",
                    "manage_account_title": "To manage Your Account: ",
                    "manage_account_text": "to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.",
                    "performance_title": "For the performance of a contract:",
                    "performance_text": "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.",
                    "contact_title": "To contact You: ",
                    "contact_text": "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.",
                    "provide_title": "To provide You",
                    "provide_text": "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.",
                    "manage_request_title": "To manage Your requests: ",
                    "manage_request_text": "To attend and manage Your requests to Us.",
                    "business_title": "For business transfers: ",
                    "business_text": "We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which Personal Data held by Us about our Service users is among the assets transferred.",
                    "other_title": "For other purposes: ",
                    "other_text": "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.",
                    "situations":"We may share Your personal information in the following situations: ",
                    "web_provider_title": "With Service Providers: ",
                    "web_provider_text": "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.",
                    "business_transfer_title": "For business transfers:",
                    "business_transfer_text": "We may share or transfer Your personal information in connection with, or during negotiations of, any merger, sale of Company assets, financing, or acquisition of all or a portion of Our business to another company.",
                    "affiliates_title": "With Affiliates:",
                    "affiliates_text": "We may share Your information with Our affiliates, in which case we will require those affiliates to honor this Privacy Policy. Affiliates include Our parent company and any other subsidiaries, joint venture partners or other companies that We control or that are under common control with Us.",
                    "business_partners_title": "With business partners: ",
                    "business_partners_text": "We may share Your information with Our business partners to offer You certain products, services or promotions.",
                    "other_users_title": "With other users: ",
                    "other_users_text": "when You share personal information or otherwise interact in the public areas with other users, such information may be viewed by all users and may be publicly distributed outside. If You interact with other users or register through a Third-Party Social Media Service, Your contacts on the Third-Party Social Media Service may see Your name, profile, pictures and description of Your activity. Similarly, other users will be able to view descriptions of Your activity, communicate with You and view Your profile.",
                    "content_title": "With Your consent: ",
                    "content_text": "We may disclose Your personal information for any other purpose with Your consent."
                },
                "retention": {
                    "header": "Retention of Your Personal Data",
                    "retent": "The Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.",
                    "usage": "The Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods."
                },
                "transfer": {
                    "header": "Transfer of Your Personal Data",
                    "information": "Your information, including Personal Data, is processed at the Company's operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.",
                    "consent": "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.",
                    "company": "The Company will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information."
                },
                "disclosure":{
                    "header": "Disclosure of Your Personal Data",
                    "business_title": "Business Transactions",
                    "business_text": "If the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred. We will provide notice before Your Personal Data is transferred and becomes subject to a different Privacy Policy.",
                    "law_title": "Law enforcement",
                    "law_text": "Under certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).",
                    "legal_title": "Other legal requirements",
                    "legal_text": "The Company may disclose Your Personal Data in the good faith belief that such action is necessary to:",
                    "comply": "Comply with a legal obligation",
                    "protect": "Protect and defend the rights or property of the Company",
                    "prevent": "Prevent or investigate possible wrongdoing in connection with the Service",
                    "personal_safety": "Protect the personal safety of Users of the Service or the public",
                    "liability": "Protect against legal liability"
                },
                "security": {
                    "header": "Security of Your Personal Data",
                    "text": "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security."
                },
                "children": {
                    "header": "Children's Privacy",
                    "text": "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.",
                    "rely": "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information."
                },
                "links": {
                    "header": "Links to Other Websites",
                    "text": "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.",
                    "responsibility": "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services."
                },
                "changes" :{
                    "header": "Changes to this Privacy Policy",
                    "update": "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.",
                    "let_know": "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the 'Last update' date at the top of this Privacy Policy.",
                    "advised": "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page."
                },
                "contact": {
                    "header": "Contact Us",
                    "questions": "If you have any questions about this Privacy Policy, You can contact us:",
                    "email": "By email: kotlinski95@gmail.com",
                    "page": "By visiting this page on our website:",
                    "page_url": "https://www.kotlinskidev.pl/contact"
                }
            }
        },
        "cookies": {
            "header": "Cookies Policy",
            "update": "Last updated: May 19, 2021",
            "explains": "This Cookies Policy explains what Cookies are and how We use them. You should read this policy so You can understand what type of cookies We use, or the information We collect using Cookies and how that information is used. This Cookies Policy has been created with the help of the ",
            "generator": "Cookies Policy Generator.",
            "cookies": "Cookies do not typically contain any information that personally identifies a user, but personal information that we store about You may be linked to the information stored in and obtained from Cookies. For further information on how We use, store and keep your personal data secure, see our Privacy Policy.",
            "sensitive": "We do not store sensitive personal information, such as mailing addresses, account passwords, etc. in the Cookies We use.",
            "interpretation_definitions": {
                "header": "Interpretation and Definitions",
                "interpretation": {
                    "header": "Interpretation",
                    "text": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural."
                },
                "definitions":{
                    "header": "Definitions",
                    "text": "For the purposes of this Cookies Policy:",
                    "company_title": "Company",
                    "company_text": "referred to as either 'the Company', 'We', 'Us' or 'Our' in this Cookies Policy) refers to kotlinskidev.",
                    "cookies_title": "Cookies",
                    "cookies_text": "means small files that are placed on Your computer, mobile device or any other device by a website, containing details of your browsing history on that website among its many uses.",
                    "website_title": "Website",
                    "website_text": "refers to kotlinskidev, accessible from ",
                    "website_url": "https://www.kotlinskidev.pl/",
                    "you_title": "You",
                    "you_text": "means the individual accessing or using the Website, or a company, or any legal entity on behalf of which such individual is accessing or using the Website, as applicable."
                },
                "cookies": {
                    "header": "The use of the Cookies",
                    "text": "Type of Cookies We Use",
                    "persistent": "Cookies can be 'Persistent' or 'Session' Cookies. Persistent Cookies remain on your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close your web browser.",
                    "session": "We use both session and persistent Cookies for the purposes set out below:",
                    "essential_cookies_text": "Necessary / Essential Cookies",
                    "essential_cookies_type": "Type: Session Cookies",
                    "essential_cookies_administrated": "Administered by: Us",
                    "essential_cookies_purpose": "Purpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.",
                    "functional_cookies_text": "Functionality Cookies",
                    "functional_cookies_type": "Type: Persistent Cookies",
                    "functional_cookies_administrated": "Administered by: Us",
                    "functional_cookies_purpose": "Purpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website."
                },
                "choises":{
                    "header": "Your Choices Regarding Cookies",
                    "text": "If You prefer to avoid the use of Cookies on the Website, first You must disable the use of Cookies in your browser and then delete the Cookies saved in your browser associated with this website. You may use this option for preventing the use of Cookies at any time.",
                    "not_accept": "If You do not accept Our Cookies, You may experience some inconvenience in your use of the Website and some features may not function properly.",
                    "delete" : "If You'd like to delete Cookies or instruct your web browser to delete or refuse Cookies, please visit the help pages of your web browser.",
                    "chrome": "For the Chrome web browser, please visit this page from Google: ",
                    "chrome_link": "https://support.google.com/accounts/answer/32050",
                    "explorer": "For the Internet Explorer web browser, please visit this page from Microsoft: ",
                    "explorer_link": "http://support.microsoft.com/kb/278835",
                    "firefox":"For the Firefox web browser, please visit this page from Mozilla: ",
                    "firefox_link": "https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored ",
                    "safari" : "For the Safari web browser, please visit this page from Apple: ",
                    "safari_link": "https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac",
                    "other": "For any other web browser, please visit your web browser's official web pages."
                },
                "more": {
                    "header": "More Information about Cookies",
                    "text": "You can learn more about cookies: ",
                    "cookies_what_are": "What Are Cookies?"
                },
                "contact": {
                    "header": "Contact Us",
                    "text": "If you have any questions about this Cookies Policy, You can contact us:",
                    "email": "By email: kotlinski95@gmail.com",
                    "website": "By visiting this page on our website:",
                    "website_url": " https://www.kotlinskidev.pl/contact"
                }
            }
        },
        "contact": {
            "header": "Do you have a question or want to contact me? Or maybe you have any comments about the website? Feel free to send me email.",
            "name": "Name",
            "email": "Email",
            "subject": "Subject",
            "message": "Message",
            "send": "Send",
            "feedback": "Thank you for your message! I'll send you response as fast as I can."
        },
        "stack":{
            "front_header": "Front-end developer stack"
        },
        "projects":{
            "header": "Projects",
            "portfolio": "Basic Portfolio",
            "quiz": "Star Wars Quiz",
            "chess": "Coders chess",
            "estate": "Real Estate website"
        },
        "aboutme": {
            "main" : {
                "header": "About me",
                "text": "My name is Adrian Kotliński, I live in Katowice. I studied Automation and Robotics at the AGH University of Science and Technology in Krakow. I'm a web development adept, constantly looking for new challenges in this area. I love minimalist design and subtle animations. I want to develop in technologies related to TypeScript and React, this page was created for the purposes of self-education in this area.",
                "see_myprofile": "For more, see my profile",
                "education_header": "Education process",
                "education_text": "I started to be interested in programming in general already around 2014. At the end of the technical school, I already knew that I wanted to connect my future with it. During my studies, I learned many interesting programming languages, initially I focused my path on industrial automation and application programming in the automotive industry, which was directly related to my study profile",
                "education_course": "At the end of 2020, I changed my direction to web development. I joined the ",
                "education_continue": " ,which is a remote web programming course, thanks to which I learned many basics allowing me to create independent projects. This is where I first came into contact with React. I also learned a lot of good programming practices there. In the meantime, I also participated in the nationwide remote coders camp programming course, where I learned about JavaScript, TypeScirpt, React and NodeJS for a period of 5 months. I finished this course in April 2020, and since then I have been continuing my independent studies every day. I not only consolidate the knowledge I have gained so far, but also learn new solutions and technologies.",
                "see_education": "More about my education",
                "see_courses": "More about my courses",
                "see_easycode": "Easy-Code ",
                "personality_header": "Personality",
                "personality_text": "A bit about me - I'm a calm and ambitious person. I love working in a team and learning new things. I'm not afraid of challenges, on the contrary - I'm constantly looking for them. Solving problems on your own is, in my opinion, the best way to learn.",
                "see_blog": "More about me in my blog",
                "experience_header": "Experience",
                "experience_text": "I started my programming career in 2018, where during my studies I worked as a programmer of automotive control systems on many foreign projects. Experience on foreign projects has significantly raised my level of English. I have no problems with understanding the documentation or communication. From December 2020, I started gaining my first experience as a web developer. I am currently working as a junior front-end developer, dealing with the development of online stores on the shopify platform. This work significantly raised my level of knowledge about the IT environment, teamwork, Agile and Scrum methods, Git support and, above all, web programming.",
                "see_experience_plc": "More about my PLC programming experience",
                "see_experience_web": "More about my Web-developer carrier",
                "contact": "Contact",
                "contact_text": "Feel free to contact me, whether it's about work or a casual conversation. I will be happy to reply to any message I receive. ",
                "see_contact": "Go to the contact form"
            }
        }
    }

}