{
    "general": {
        "website": "kotlinskidev.pl",
        "pageTitle": "❤ ️ come back!",
        "banner" : "The website is under construction. Some functionalities may not be available yet, if you have any questions, please contact me!",
        "titles": {
            "home": "Adrian Kotliński | FrontEnd Developer",
            "about": "About me | Adrian K. | FrontEnd Developer",
            "courses": "Courses | Adrian K. | FrontEnd Developer",
            "education": "Education | Adrian K. | FrontEnd Developer",
            "frontEndDevelopment": "Web development | Adrian K. | FrontEnd Developer",
            "plcCarrier": "PLC carrier | Adrian K. | FrontEnd Developer",
            "myprofile": "My Profile | Adrian K. | FrontEnd Developer",
            "myprofileContact": "Profile - Contact | Adrian K. | FrontEnd Developer",
            "myprofileEducation": "Profile - Education | Adrian K. | FrontEnd Developer",
            "myprofileHobby": "Profile - Hobby | Adrian K. | FrontEnd Developer",
            "myprofileOverview": "Profile | Adrian K. | FrontEnd Developer",
            "myprofileSpareTime": "Profile - spare time | Adrian K. | FrontEnd Developer",
            "myprofileWork": "Profile - Work | Adrian K. | FrontEnd Developer",
            "projects": "Projects | Adrian K. | FrontEnd Developer",
            "projectsChess": "Chess | Adrian K. | FrontEnd Developer",
            "projectsEstate": "Estate agent | Adrian K. | FrontEnd Developer",
            "projectsPortfolio": "Portfolio | Adrian K. | FrontEnd Developer",
            "projectsQuiz": "Quiz | Adrian K. | FrontEnd Developer",
            "projectsWebsite": "Portfolio | Adrian K. | FrontEnd Developer",
            "services": "Services | Adrian K. | FrontEnd Developer",
            "servicesPlc":"Services - PLC | Adrian K. | FrontEnd Developer",
            "servicesShopify": "Services - Shopify | Adrian K. | FrontEnd Developer",
            "servicesWeb": "Services - Web | Adrian K. | FrontEnd Developer",
            "stack": "Stack | Adrian K. | FrontEnd Developer",
            "stackFutomation": "Stack Automation | Adrian K. | FrontEnd Developer",
            "stackFront": "Stack FrontEnd | Adrian K. | FrontEnd Developer",
            "contact": "Contact | Adrian K. | FrontEnd Developer",
            "cookies": "Cookies | Adrian K. | FrontEnd Developer",
            "notFound" :"Page Not Found | Adrian K. | FrontEnd Developer",
            "privacy" : "Privacy Policy | Adrian K. | FrontEnd Developer"
        }
    },
    "header": {
        "about": "About me",
        "myprofile": "My Profile",
        "projects": "Projects",
        "stack": "Stack",
        "contact": "Contact",
        "login": "Sign In",
        "home" : "Home",
        "cv": "Curriculum Vitae",
        "settings" : "Settings",
        "language": "Language",
        "animation": "Animation",
        "pages": {
            "carrier_plc": "PLC programmer career",
            "carrier_front": "Front-end developer career",
            "courses": "Training, courses",
            "education": "Education",
            "software_enginner": "Front-End Development",
            "automation_enginner": "Automation Engineer"
        },
        "notification": {
            "header": "Message",
            "text": "The website is under construction, some functionalities may not be available yet. Sorry for the momentary difficulties and lack of all content, I'm working on it :)"
        }
    },
    "typedText": {
        "text1": "Welcome on my webstie!",
        "text2": "This page is still in working...",
        "text3": "Be patient, sonn it will be ready! :)"
    },
    "footer":{
        "cookie_consent": {
            "first_text" : "This website uses cookies to enhance the user experience.",
            "second_text": "Accept cookies policy to get better experience!",
            "buttonText": "Accept Cookies",
            "declineButtonText": "I decline"
        },
        "privacy":{
            "rights": "https://kotlinskidev.pl - All right reserved.",
            "policy": "Privacy policy & processing personal data",
            "cookies": "Cookies policy"
        },
        "pages": {
            "services": "Services",
            "contact": "Contact",
            "web": "Web development",
            "shopify": "Shopify development",
            "plc": "PLC programming"
        }
    },
    "not_found": {
        "header": "I couldn't find what you were looking for.",
        "paragraph_reason": "Unfortunately the page you were looking for could not be found. It may be temporarily unavailable, moved or no longer exist.",
        "paragraph_todo": "Check the URL you entered for any mistakes and try again. Alternatively, search for whatever is missing or take a look around the rest of my site.",
        "search_placeholder": "Search.."
    },
    "pages": {
        "home": {
            "welcome": {
                "header": "Adrian Kotliński",
                "title": "Junior Front-end Developer",
                "scroll": "Scroll down"
            },
            "about": {
                "header": "Hello",
                "text": "My name is Adrian Kotlinski, I live in Katowice. I started my adventure with FrontEnd at the end of 2020. Since then, I have devoted every free moment to learning and it gives me great pleasure. I constantly strive to expand my competences by learning about the latest solutions and technologies.",
                "seemore": "Explore more"
            },
            "categories": {
                "header": "I invite you to visit also the other pages..",
                "about": "About me",
                "projects": "Projects",
                "stack": "Stack",
                "services": "Services",
                "profile": "Profile"
            }
        },
        "privacy": {
            "header": "Privacy Policy",
            "update": "Last updated: May 19, 2021",
            "describe": "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.",
            "personal_data": "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy. This Privacy Policy has been created with the help of the ",
            "generator": "Privacy Policy Generator",
            "interpretation": "Interpretation and Definitions",
            "interpretation_header": "Interpretation",
            "interpretation_text": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.",
            "definitions": {
                "header": "Definitions",
                "text": "For the purposes of this Privacy Policy:",
                "account_title": "Account",
                "account_label": " means a unique account created for You to access our Service or parts of our Service.",
                "company_title": "Company",
                "company_label": " (referred to as either 'the Company', 'We', 'Us' or 'Our' in this Agreement) refers to kotlinskidev",
                "cookies_title": "Cookies",
                "cookies_label": " are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.",
                "country_title": "Country",
                "country_label": " refers to: Poland",
                "device_title": "Device",
                "device_label": " means any device that can access the Service such as a computer, a cellphone or a digital tablet.",
                "personal_title": "Personal Data",
                "personal_label": " is any information that relates to an identified or identifiable individual.",
                "service_title": "Service",
                "service_label": " refers to the Website.",
                "service_provider_title": "Service Provider",
                "service_provider_label": " means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.",
                "social_title": "Third-party Social Media Service",
                "social_label": " refers to any website or any social network website through which a User can log in or create an account to use the Service.",
                "usage_title": "Usage Data",
                "usage_label": " refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).",
                "website_title": "Website",
                "website_label": " refers to kotlinskidev, accessible from ",
                "website_link": "https://www.kotlinskidev.pl",
                "you_title": "You",
                "you_label": " means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable."
            },
            "collecting_data":{
                "header": "Collecting and Using Your Personal Data",
                "text": "Types of Data Collected",
                "personal": {
                    "header": "Personal Data",
                    "text": "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:",
                    "email": "Email address",
                    "name": "First name and last name",
                    "phone": "Phone number",
                    "address": "Address, State, Province, ZIP/Postal code, City",
                    "usage": "Usage Data"
                },
                "usage": {
                    "header": "Usage Data",
                    "collection": "Usage Data is collected automatically when using the Service.",
                    "include": "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.",
                    "access": "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.",
                    "collect": "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device."
                },
                "third": {
                    "header": "Information from Third-Party Social Media Services",
                    "text": "The Company allows You to create an account and log in to use the Service through the following Third-party Social Media Services:",
                    "google": "Google",
                    "facebook": "Facebook",
                    "twitter": "Twitter",
                    "register": "If You decide to register through or otherwise grant us access to a Third-Party Social Media Service, We may collect Personal data that is already associated with Your Third-Party Social Media Service's account, such as Your name, Your email address, Your activities or Your contact list associated with that account.",
                    "additional": "You may also have the option of sharing additional information with the Company through Your Third-Party Social Media Service's account. If You choose to provide such information and Personal Data, during registration or otherwise, You are giving the Company permission to use, share, and store it in a manner consistent with this Privacy Policy."
                },
                "tracking": {
                    "header": "Tracking Technologies and Cookies",
                    "cookies": "We use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:",
                    "cookies_title": "Cookies or Browser Cookies.",
                    "cookies_text": "A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service. Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies.",
                    "flash_title": "Flash Cookies.",
                    "flash_text": "Certain features of our Service may use local stored objects (or Flash Cookies) to collect and store information about Your preferences or Your activity on our Service. Flash Cookies are not managed by the same browser settings as those used for Browser Cookies. For more information on how You can delete Flash Cookies, please read 'Where can I change the settings for disabling, or deleting local shared objects?' available at", 
                    "flash_link" : "https://helpx.adobe.com/flash-player/kb/disable-local-shared-objects-flash.html#main_Where_can_I_change_the_settings_for_disabling__or_deleting_local_shared_objects_",
                    "beacons_title": "Web Beacons.",
                    "beacons_text": "Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity).",
                    "persistent": "Cookies can be 'Persistent' or 'Session' Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies:",
                    "what_cookies_are": "What Are Cookies?",
                    "session": "We use both Session and Persistent Cookies for the purposes set out below:",
                    "necessary": "Necessary / Essential Cookies",
                    "type": "Type: Session Cookies",
                    "administered": "Administered by: Us",
                    "purpose": "Purpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.",
                    "cookies_policy": "Cookies Policy / Notice Acceptance Cookies",
                    "cookies_policy_type": "Type: Persistent Cookies",
                    "cookies_policy_administered": "Administered by: Us",
                    "cookies_purpose": "Purpose: These Cookies identify if users have accepted the use of cookies on the Website.",
                    "cookies_functionality": "Functionality Cookies",
                    "cookies_functionality_type": "Type: Persistent Cookies",
                    "cookies_functionality_administered": "Administered by: Us",
                    "cookies_website": "Purpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.",
                    "more": "For more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy."
                },
                "use_personal": {
                    "header": "Use of Your Personal Data",
                    "text": "The Company may use Personal Data for the following purposes:",
                    "service_title": "To provide and maintain our Service",
                    "service_text": ", including to monitor the usage of our Service.",
                    "manage_account_title": "To manage Your Account: ",
                    "manage_account_text": "to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.",
                    "performance_title": "For the performance of a contract:",
                    "performance_text": "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.",
                    "contact_title": "To contact You: ",
                    "contact_text": "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.",
                    "provide_title": "To provide You",
                    "provide_text": "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.",
                    "manage_request_title": "To manage Your requests: ",
                    "manage_request_text": "To attend and manage Your requests to Us.",
                    "business_title": "For business transfers: ",
                    "business_text": "We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which Personal Data held by Us about our Service users is among the assets transferred.",
                    "other_title": "For other purposes: ",
                    "other_text": "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.",
                    "situations":"We may share Your personal information in the following situations: ",
                    "web_provider_title": "With Service Providers: ",
                    "web_provider_text": "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.",
                    "business_transfer_title": "For business transfers:",
                    "business_transfer_text": "We may share or transfer Your personal information in connection with, or during negotiations of, any merger, sale of Company assets, financing, or acquisition of all or a portion of Our business to another company.",
                    "affiliates_title": "With Affiliates:",
                    "affiliates_text": "We may share Your information with Our affiliates, in which case we will require those affiliates to honor this Privacy Policy. Affiliates include Our parent company and any other subsidiaries, joint venture partners or other companies that We control or that are under common control with Us.",
                    "business_partners_title": "With business partners: ",
                    "business_partners_text": "We may share Your information with Our business partners to offer You certain products, services or promotions.",
                    "other_users_title": "With other users: ",
                    "other_users_text": "when You share personal information or otherwise interact in the public areas with other users, such information may be viewed by all users and may be publicly distributed outside. If You interact with other users or register through a Third-Party Social Media Service, Your contacts on the Third-Party Social Media Service may see Your name, profile, pictures and description of Your activity. Similarly, other users will be able to view descriptions of Your activity, communicate with You and view Your profile.",
                    "content_title": "With Your consent: ",
                    "content_text": "We may disclose Your personal information for any other purpose with Your consent."
                },
                "retention": {
                    "header": "Retention of Your Personal Data",
                    "retent": "The Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.",
                    "usage": "The Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods."
                },
                "transfer": {
                    "header": "Transfer of Your Personal Data",
                    "information": "Your information, including Personal Data, is processed at the Company's operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.",
                    "consent": "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.",
                    "company": "The Company will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information."
                },
                "disclosure":{
                    "header": "Disclosure of Your Personal Data",
                    "business_title": "Business Transactions",
                    "business_text": "If the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred. We will provide notice before Your Personal Data is transferred and becomes subject to a different Privacy Policy.",
                    "law_title": "Law enforcement",
                    "law_text": "Under certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).",
                    "legal_title": "Other legal requirements",
                    "legal_text": "The Company may disclose Your Personal Data in the good faith belief that such action is necessary to:",
                    "comply": "Comply with a legal obligation",
                    "protect": "Protect and defend the rights or property of the Company",
                    "prevent": "Prevent or investigate possible wrongdoing in connection with the Service",
                    "personal_safety": "Protect the personal safety of Users of the Service or the public",
                    "liability": "Protect against legal liability"
                },
                "security": {
                    "header": "Security of Your Personal Data",
                    "text": "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security."
                },
                "children": {
                    "header": "Children's Privacy",
                    "text": "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.",
                    "rely": "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information."
                },
                "links": {
                    "header": "Links to Other Websites",
                    "text": "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.",
                    "responsibility": "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services."
                },
                "changes" :{
                    "header": "Changes to this Privacy Policy",
                    "update": "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.",
                    "let_know": "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the 'Last update' date at the top of this Privacy Policy.",
                    "advised": "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page."
                },
                "contact": {
                    "header": "Contact Us",
                    "questions": "If you have any questions about this Privacy Policy, You can contact us:",
                    "email": "By email: kotlinski95@gmail.com",
                    "page": "By visiting this page on our website:",
                    "page_url": "https://www.kotlinskidev.pl/contact"
                }
            }
        },
        "cookies": {
            "header": "Cookies Policy",
            "update": "Last updated: May 19, 2021",
            "explains": "This Cookies Policy explains what Cookies are and how We use them. You should read this policy so You can understand what type of cookies We use, or the information We collect using Cookies and how that information is used. This Cookies Policy has been created with the help of the ",
            "generator": "Cookies Policy Generator.",
            "cookies": "Cookies do not typically contain any information that personally identifies a user, but personal information that we store about You may be linked to the information stored in and obtained from Cookies. For further information on how We use, store and keep your personal data secure, see our Privacy Policy.",
            "sensitive": "We do not store sensitive personal information, such as mailing addresses, account passwords, etc. in the Cookies We use.",
            "interpretation_definitions": {
                "header": "Interpretation and Definitions",
                "interpretation": {
                    "header": "Interpretation",
                    "text": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural."
                },
                "definitions":{
                    "header": "Definitions",
                    "text": "For the purposes of this Cookies Policy:",
                    "company_title": "Company",
                    "company_text": "referred to as either 'the Company', 'We', 'Us' or 'Our' in this Cookies Policy) refers to kotlinskidev.",
                    "cookies_title": "Cookies",
                    "cookies_text": "means small files that are placed on Your computer, mobile device or any other device by a website, containing details of your browsing history on that website among its many uses.",
                    "website_title": "Website",
                    "website_text": "refers to kotlinskidev, accessible from ",
                    "website_url": "https://www.kotlinskidev.pl/",
                    "you_title": "You",
                    "you_text": "means the individual accessing or using the Website, or a company, or any legal entity on behalf of which such individual is accessing or using the Website, as applicable."
                },
                "cookies": {
                    "header": "The use of the Cookies",
                    "text": "Type of Cookies We Use",
                    "persistent": "Cookies can be 'Persistent' or 'Session' Cookies. Persistent Cookies remain on your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close your web browser.",
                    "session": "We use both session and persistent Cookies for the purposes set out below:",
                    "essential_cookies_text": "Necessary / Essential Cookies",
                    "essential_cookies_type": "Type: Session Cookies",
                    "essential_cookies_administrated": "Administered by: Us",
                    "essential_cookies_purpose": "Purpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.",
                    "functional_cookies_text": "Functionality Cookies",
                    "functional_cookies_type": "Type: Persistent Cookies",
                    "functional_cookies_administrated": "Administered by: Us",
                    "functional_cookies_purpose": "Purpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website."
                },
                "choises":{
                    "header": "Your Choices Regarding Cookies",
                    "text": "If You prefer to avoid the use of Cookies on the Website, first You must disable the use of Cookies in your browser and then delete the Cookies saved in your browser associated with this website. You may use this option for preventing the use of Cookies at any time.",
                    "not_accept": "If You do not accept Our Cookies, You may experience some inconvenience in your use of the Website and some features may not function properly.",
                    "delete" : "If You'd like to delete Cookies or instruct your web browser to delete or refuse Cookies, please visit the help pages of your web browser.",
                    "chrome": "For the Chrome web browser, please visit this page from Google: ",
                    "chrome_link": "https://support.google.com/accounts/answer/32050",
                    "explorer": "For the Internet Explorer web browser, please visit this page from Microsoft: ",
                    "explorer_link": "https://support.microsoft.com/kb/278835",
                    "firefox":"For the Firefox web browser, please visit this page from Mozilla: ",
                    "firefox_link": "https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored ",
                    "safari" : "For the Safari web browser, please visit this page from Apple: ",
                    "safari_link": "https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac",
                    "other": "For any other web browser, please visit your web browser's official web pages."
                },
                "more": {
                    "header": "More Information about Cookies",
                    "text": "You can learn more about cookies: ",
                    "cookies_what_are": "What Are Cookies?"
                },
                "contact": {
                    "header": "Contact Us",
                    "text": "If you have any questions about this Cookies Policy, You can contact us:",
                    "email": "By email: kotlinski95@gmail.com",
                    "website": "By visiting this page on our website:",
                    "website_url": " https://www.kotlinskidev.pl/contact"
                }
            }
        },
        "contact": {
            "title": "Contact",
            "write": "Write to me!",
            "header": "Do you have a question or want to contact me? Or maybe you have any comments about the website? Feel free to send me email.",
            "name": "Name",
            "name_placeholder": "What do I call you?",
            "email": "Email",
            "email_placeholder": "Where can I send a reply?",
            "subject": "Subject",
            "subject_placeholder": "What do you want to talk about?",
            "message": "Message",
            "message_placeholder": "You can write about anything you want!",
            "send": "Send",
            "feedback": "Thank you for your message! I'll send you response as fast as I can.",
            "error": "Sorry, something went wrong. Try to send the message again. :(",
            "mail": "kotlinski95@gmail.com",
            "phone": "+48 608 418 911",
            "consent" : "*I accept ",
            "consent_and": " and ",
            "consent_regulamin" : "regulation",
            "consent_privacy" : "privacy policy"
        },
        "stack":{
            "front_header": "Front-end developer stack",
            "automation_header": "Automation Engineer stack",
            "automation": "Automation",
            "web": "Web development",
            "stack": "See my technology stack",
            "automation_text": "I have always been fascinated by modern technology, artificial intelligence, electronics and programming. I try to combine my interests and develop in these technologies.",
            "web_text": "I'm currently developing in the field of web technologies and I'm trying to improve my skills in this area by implementing my own projects",
            "html": {
                "title": "HTML",
                "intro": "I'm constantly developing my skills in the field of HTML writing, currently I'm trying to delve into the secrets of SEO so that the website is positioned in the best search engines.",
                "close": "close",
                "text": "HTML is the code used to structure the page and its content. HTML isn't a programming language; is a markup language. HTML consists of a series of tags (tags) that are used to enclose and wrap different parts of your content so that they look and / or act a certain way. The page you are on would not be created without HTML. The main element of the page is the index.html file on which the entire page is based.",
                "source": "https://developer.mozilla.org/pl/docs/Learn/Getting_started_with_the_web/HTML_basics"
            },
            "css": {
                "title": "Css",
                "close": "close",
                "text": "It's thanks to the use of CSS that the entire appearance of this website was created! At every step, I'm expanding my skills in using styles to create pages that with their appearance allow them to gain the attention of users and increase the site's rating.",
                "intro": "Like HTML, CSS isn't a programming language. But it's also not a markup language - it's a style sheet language. This means that it allows you to selectively apply styles to elements in HTML documents. With the help of styles, we can give the website any look!",
                "source": "https://developer.mozilla.org/pl/docs/Learn/Getting_started_with_the_web/CSS_basics"
            },
            "js": {
                "title": "JavaScript",
                "intro": "JavaScript is a programming language that allows the implementation of complex elements on the website, thanks to which the website can't only display static information, but also handle changing the content according to the situation, display interactive maps and animations of 2D / 3D graphics, display video, etc.",
                "close": "close",
                "text": "The development in the area of ​​JavaScript is my main goal, the increasing proficiency in this language makes me able to write more and more advanced web applications. I use this language on a daily basis. He assesses his knowledge at a good level, sufficient to write web applications on his own.",
                "source": "https://developer.mozilla.org/pl/docs/Learn/JavaScript/First_steps/What_is_JavaScript"
            },
            "sass": {
                "title": "Sass",
                "close": "close",
                "intro": "SASS is a CSS preprocessor, it's an extension of the CSS writable capabilities. Sass preprocessor is a tool by which we write code similar to regular CSS, but with many improvements, and which is finally compiled to plain CSS; Sass allows you to write code in two syntaxes - SASS or SCSS.",
                "text": "The current project uses mainly Sass, everything is compiled by React to the classic Css. I see many advantages of using the Sass preprocessor and I try to develop in this direction mainly in conjunction with the React library.",
                "source": "https://grafmag.pl/artykuly/wstep-do-sass-prepreocesora-jezyka-css"
            },
            "bootstrap": {
                "title": "Bootstrap",
                "close": "close",
                "intro": "Bootstrap is the most popular CSS framework created and developed by Twitter developers. It's mainly based on ready-made HTML and CSS solutions. Bootstrap contains a set of useful components to facilitate the work of a Front-End Developer and the creation of responsive websites and web applications. The main advantage of the Bootstrap implementation is the grid, which, depending on the screen size, adjusts the width of the elements and sets the order in which they appear in the column. Additionally, it includes a long list of predefined classes for styling the most necessary elements.",
                "text": "In my projects, I try not to use this library, relying on my own styles. At work, however, I often use this library for various projects, so I know the basics of working with this library.",
                "source": "https://psd2css.pl/baza-wiedzy/co-to-jest-bootstrap"
            },
            "rwd": {
                "title": "Rwd",
                "close": "close",
                "intro": "RWD (responsive web design) is a way of designing universal websites that will properly adapt to the size of the browser window of all devices, taking into account e.g. tablets, smartphones, TVs and monitors with standard and high resolutions.",
                "text": "The proper functioning of the web application, both in the form of a desktop and on mobile devices, is crucial, I always make sure that my applications work properly on every device and I attach great importance to it.",
                "source": "https://www.artefakt.pl/blog/web-design/responsive-web-design-czym-jest-i-do-czego-sluzy"
            },
            "react": {
                "title": "React",
                "close": "close",
                "intro": "React is a so-called JavaScript programming language library. It's used when creating user interfaces for various types of applications. It is available to a wide audience on an open source basis. Thanks to it, you can create a very complex interface, consisting of small, separated elements. ",
                "text": "The React library is one of my favorites and it's in this direction that I want to develop, I try to use it regularly and expand my skills in this area. I believe that I have a lot of knowledge in this topic and I rate my knowledge of React as good. This page, which was entirely written based on this library, can prove it!",
                "source": "https://global4net.com/ecommerce/czym-jest-react-i-jakie-ma-zalety/"
            },
            "styledComponents": {
                "title": "Styled Components",
                "close": "close",
                "intro": "Styled components is a library that uses interpolated strings introduced in JavaScript ES6. It allows you to easily style React components by adding styles directly to the component.",
                "text": "I'm not a fan of direct styling, but in the case of this library I see a lot of benefits from direct styling simple components, which greatly speed up the work, without the need to create a separate component. While expanding my knowledge in the field of React, I also decided to get acquainted with this library, which is why this page also has several components created using styled-components.",
                "source": "https://www.margo-group.com/pl/aktualnosci/dlaczego-warto-zaczac-uzywac-styled-components-bezstresowe-stylowanie-z-nowoczesna-technologia/"
            },
            "shopify": {
                "title": "Shopify",
                "close": "close",
                "intro": "Shopify is one of the most popular e-commerce platform on the market and is used in over 175 countries around the world. Founded in 2004, it helps merchants around the world host and build a website, upload products, collect payments and earn money online.",
                "text": "I've contact with the shopify platform every day, currently I work as a junior Front-End developer dealing with the creation of online stores using this platform. In the company, as a shopify developer, I am responsible for creating stores, website optimization, implementing new functionalities at the customer's request and repairing current errors on websites.",
                "source": "https://www.moj-startup.pl/shopify-opinie/#Co_to_jest_Shopify"
            },
            "git": {
                "title": "Git",
                "close": "close",
                "intro": "Git is a version control system. Tracks subsequent code changes and saves individual versions. Thanks to this, almost nothing is lost. We can open up the history of how the code has changed. Git also tracks changes to image files. It's very popular with programmers and graphic designers. Even if you make a mistake or after some time it turns out that your changes are going in the wrong direction and you are not able to achieve your goal thanks to them, you can easily withdraw it.",
                "text": "I'm a huge fan of git and I cannot imagine working without this tool. Code versioning is essential when working as a programmer. At work, I use tools such as bitbucket and github to control file versions on a daily basis, which I know at a good level and I use them freely.",
                "source": "https://panizkomputerem.pl/czym-jest-git/"
            },
            "node": {
                "title": "Node JS",
                "close": "close",
                "intro": "Node.js is the runtime for executing JavaScript code. Previously, developers only ran their JavaScript code with browsers. Today Node.js works independently of the browser and allows you to run JavaScript code outside the browser as well. Node.js as a runtime environment allows not only to create web applications in an easier way. It's also a tool for creating server side applications, all kinds of scripts and libraries.",
                "text": "I use Node Js for my own applications, I do not work professionally with this framework, but I think that even a Front-End developer should have basic knowledge in this field. From my perspective, it is a great tool that uses the JavaScript language I know, so I chose it to create the backend of this website.",
                "source": "https://zacznijprogramowac.net/slowniczek-javascript/co-to-jest-node-js/"
            },
            "typeScript": {
                "title": "TypeScript",
                "close": "close",
                "intro": "TypeScript is a free and open source programming language created and developed by Microsoft since 2012. It is a development of JavaScript that adds optional static typing and a few extra things. TypeScript compiles to JavaScript and can be used both on the server side (node.js) and in the browser.",
                "text": "From my perspective, TypeScript is an indispensable successor to classic JavaScript, although it is compilable itself as a last resort, it allows you to write much safer and more efficient code than in the case of regular Js. From the moment I felt comfortable using JavaScript, I now try to use TypeScript at every opportunity. You may notice that this page was written almost entirely using TypeScipt :)",
                "source": "https://typeofweb.com/typescript-czesc-1/"
            },
            "tia": {
                "title": "TIA Portal",
                "close": "close",
                "intro": "The TIA Portal design platform allows the integration of modern industrial automation components, which facilitates the implementation of the concept of industry 4.0 in factories and production plants.",
                "text": "As an industrial automation specialist in automotive plants, I was involved in programming Siemens industrial controllers. The TIA portal is the runtime environment for these drivers. I took part in several projects dealing with PLC programming, HMI visualization, SCADA systems and Motion Control in TIA V15 and V16.",
                "source": "https://new.siemens.com/pl/pl/produkty/automatyka/tia-portal.StackTiaComponent"
            },
            "plc": {
                "title": "Programmable Logic Controller (PLC)",
                "close": "close",
                "intro": "Programmable logic controllers (PLCs) are small industrial computers with modular components designed to automate custom control processes. PLCs are often used in factories and industrial plants to control motors, pumps, lighting, fans, circuit breakers and other machinery.",
                "text": "As an industrial automation specialist in automotive plants, I was involved in the programming of industrial controllers of several different companies, such as Siemens, B&R, and Mitsubishi. The controller plays the role of a control system in such a system and is responsible for the sequence of work of the entire automated industrial line, often reaching even several hundred meters.",
                "source": "https://polskiprzemysl.com.pl/utrzymanie-ruchu/co-to-jest-sterownik-plc/"
            },
            "hmi": {
                "title": "Human-Machine Interface (HMI)",
                "close": "close",
                "intro": "An HMI is an industrial interface between a machine or process and the operator who operates it. Thanks to HMI, the person responsible for the implementation of production tasks can influence and control the process.",
                "text": "As an industrial automation specialist, I also dealt with the creation of visualizations for operator panels. My task was to create an interface that would allow the operator to control the machine or production line. I created visualization in both the Tia Portal and Automation Studio environments.",
                "source": "https://www.astor.com.pl/poradnikautomatyka/wszystko-o-hmi-co-automatyk-powinien-wiedziec/"
            },
            "embedded": {
                "title": "Embedded systems",
                "close": "close",
                "intro": "An embedded system is a computer system consisting of appropriately selected hardware and software components, often designed for a specific software application. It is responsible for the performance of its functions and affects the way of communication with the user.",
                "text": "Already during the technical school, I became interested in widely understood electronics and DIY. As a hobby, I sometimes program mictrocontrollers and small control systems for my own use based on Raspberry PI or Arduino.",
                "source": "https://automatykab2b.pl/temat-miesiaca/39446-systemy-wbudowane"
            },
            "motion": {
                "title": "Motion systems",
                "close": "close",
                "intro": "Drive technology refers to a discipline that generally relates to technical systems for generating motion through the transmission of force. Although the propulsion technology is based on the word 'propulsion', this term is not related to the transmission system known, for example, from cars. Rather, it is about driving and controlling the moving parts of machines and the set of parts that ensure this movement.",
                "text": "As an industrial automation specialist in the automotive industry, I was involved in the creation of control systems consisting in some production lines of several dozen drives, these were mainly SEW servo drives programmed with the use of MotionStudio.",
                "source": "https://www.igus.pl/info/drive-technology-drylin-drive-systems"
            },
            "scada": {
                "title": "Supervisory Control And Data Acquisition",
                "close": "close",
                "intro": "SCADA stands for Supervisory Control And Data Acquisition, which we can literally translate as supervision and data acquisition. In fact, SCADA is an IT system supervising the course of the technological process, it is superior to the hardware layer (controllers, I / O modules) and performs the following tasks: Real-time data exchange with a PLC or I / O module, real-time information processing , displaying information on the screen in a human-readable form, maintaining a database in real time with technological information, alarm management and alarm signaling, preparation and generation of reports on the progress of the technological process and archiving of technological information.",
                "text": "As an industrial automation specialist in the automotive industry, I was involved in the creation of scada systems visualization based on the WinCC program, such a system provided full visualization of the line operation, information about alarms and line downtimes, and line efficiency over time.",
                "source": "https://iautomatyka.pl/co-to-jest-scada-i-co-daje-wizualizacja-procesow-przemyslowych/"
            },
            "safety": {
                "title": "Safety systems",
                "close": "close",
                "intro": "Safety systems are a combination of reliable sensors and a flexible safety controller. They are particularly suitable for applications with high demands on human protection. These systems can be easily integrated into existing installations, and thanks to the included documentation and sample programs - they can be quickly put into operation.",
                "text": "One of the key factors when working on a production line is employee safety. The task of industrial automation is not only to ensure the writing of a fully functioning program, but also the operation of safety sensors and safe control of actuators to ensure complete safety of people working on the line.",
                "source": "https://www.sick.com/pl/pl/systemy-bezpieczenstwa-i-rozwiazania-w-zakresie-bezpieczenstwa/systemy-bezpieczenstwa/c/g449152"
            },
            "microcontroller": {
                "title": "Microcontrollers",
                "close": "close",
                "intro": "The microcontroller is one of the most important devices in robotics. This tiny single-chip microcomputer, also known as an integrated microprocessor system, includes components such as RAM, CPU and various I / O circuits, as well as written ROM or Flash memory. The device is used directly to control electronic devices, which is of course of great importance in robotics.",
                "text": "In my spare time I like to deal with programming microcontrollers for my own purposes (e.g. a self-propelled mobile robot), mainly based on systems such as Raspberry Pi and Arduino.",
                "source": "https://botland.com.pl/blog/mikrokontroler-jak-to-dziala/"
            }
        },
        "projects":{
            "header": "Projects",
            "portfolio": "Basic Portfolio",
            "quiz": "Start Wars Quiz",
            "chess": "Coders Chess",
            "estate": "Real Estate App",
            "website": "Business website",
            "next": "Next project",
            "p1_portfolio" : {
                "header": "Portfolio",
                "description": "Portfolio single Page Application (SPA)",
                "date": "01/2021",
                "stack": {
                    "html": "HTML",
                    "css": "CSS"
                },
                "links": {
                    "github": "https://github.com/Kotlinski95/myPortfolio",
                    "live": "https://kotlinski95.github.io/myPortfolio/"
                },
                "details": {
                   "intro": "This is my first Front-End project based on HTML, CSS.",
                   "text": "The implementation of this project was part of the Coders-Camp course after the first chapters on HTML and CSS beds.",
                   "finish": "This project is not an up-to-date portfolio, it is only an exemplary project based on the mentioned technologies, the current portfolio is the page you are on :)"
                }
            },
            "p2_starWarsQuiz" : {
                "header": "Star Wars Quiz",
                "description": "Knowledge quiz about star wars",
                "date": "02/2021",
                "stack": {
                    "html": "HTML",
                    "css": "CSS",
                    "js": "JavaScript"
                },
                "links": {
                    "github": "https://github.com/CodersCamp2020-JoaoSebastiao-Team/StarWarsQuiz",
                    "live": "https://coderscamp2020-joaosebastiao-team.github.io/StarWarsQuiz/"
                },
                "details": {
                   "intro": "The Star Wars Quiz is the second project made as part of the Coders-Camp course.",
                   "text": "This project was carried out in a team of 5, where the knowledge of JavaScript was used.",
                   "finish": "The game is about guessing as many characters or vehicles as possible from the popular Star Wars saga. During the game, the player competes with the computer for the best result. The results of the game are recorded in the form of a table so that players can compete with each other."
                }
            },
            "p3_codersChess" : {
                "header": "Coders Chess",
                "description": "Internet chess",
                "date": "03/2021",
                "stack": {
                    "html": "HTML",
                    "css": "CSS",
                    "js": "JavaScript",
                    "ts": "TypeScript"
                },
                "links": {
                    "github": "https://github.com/CodersCamp2020-JoaoSebastiao-Team/coders-chess",
                    "live": "http://coders-chess.herokuapp.com/"
                },
                "details": {
                   "intro": "Internet chess Coders-chess is another project made as part of the Coders-Camp course, this time as participants we had to create a browser game based on TypeScript.",
                   "text": "This project was carried out in a team of 5, where knowledge of HTML, CSS, JavaScript and TypeScript was used.",
                   "finish": "After entering their names and selecting the game time, the players join the game. the game contains hints of possible moves after pressing a given figure. On the right side of the plans, players' movements are recorded. The opponent's compact pieces appear on the board. The game ends with checkmate."
                }
            },
            "p4_estate" : {
                "header": "Real Estate App",
                "description": "Real estate office website",
                "date": "04/2021",
                "stack": {
                    "html": "HTML",
                    "css": "CSS",
                    "js": "JavaScript",
                    "ts": "TypeScript",
                    "react": "React",
                    "node": "Node JS"
                },
                "links": {
                    "github": "https://github.com/CodersCamp2020-JoaoSebastiao-Team/real-estate",
                    "live": "https://real-estate-coders-camp.herokuapp.com/"
                },
                "details": {
                   "intro": "The real estate application is the last project in the Coders-Camp course.",
                   "text": "This project was carried out in a team of 5, where knowledge of HTML, CSS, JavaScript, TypeScript, React and Node JS was used.",
                   "finish": "The website contains its own database written in Node JS using Mongo DB. The website itself is based on React and TypeScript. On the website, the user can view the advertisements of flats for sale and rent. Can log in to make a reservation or purchase."
                }
            },
            "p5_website" : {
                "header": "Business card page",
                "description": "The page you are currently on",
                "date": "06/2021",
                "stack": {
                    "html": "HTML",
                    "css": "CSS",
                    "js": "JavaScript",
                    "ts": "TypeScript",
                    "react": "React",
                    "redux": "Redux",
                    "node": "Node JS"
                },
                "links": {
                    "github": "https://github.com/Kotlinski95/kotlinskidev",
                    "live": "https://www.kotlinskidev.pl/"
                },
                "details": {
                   "intro": "This is my biggest project so far. Private showcase page with my achievements so far!",
                   "text": "This project is based mainly on React and Redux, and was mostly written with the use of TypeScript.",
                   "finish": "The website contains a lot of information about me, my skills, experiences and education. It is a convenient form of contact with me via a specially prepared form, shared e-mail and telephone number or via messenger."
                }
            }
        },
        "myprofile": {
            "header": "Adrian Kotliński",
            "profession": "Junior Front-end developer",
            "bookmarks": {
                "overview": "Overview",
                "work": "Work",
                "education" : "Education",
                "contact": "Contact information",
                "hobby" : "Hobby",
                "spareTime": "Spare time"
            },
            "overview": {
                "header": "Basic information:",
                "study_label": "Study: ",
                "study_text": "University of Science and Technology in Cracow - Automation and Robotics.",
                "live_label": "Live in : ",
                "live_text": "Katowice",
                "home_label":"Comes from: ",
                "home_text": "Żory",
                "birthday_label" : "Born: ",
                "birthday_text" : "11.02.1995",
                "phone_label" : "Phone number: ",
                "phone_text": " + 48 608 418 911"
            },
            "work" : {
                "header": "Experience:",
                "sobre_time": "04.2021 - now: ",
                "sobre_name": "Sobre",
                "sobre_title": "SOBRE Software house",
                "script_studio_time": "12.2020 - 04.2021: ",
                "script_studio_name": "Script Studio",
                "script_studio_title": "Script-Studio (easy-coder)",
                "blumenbecker_time": "09.2018 - 10.2020: ",
                "blumenbecker_name": "Blumenbecker Enginneering Polska",
                "blumenbecker_title": "Blumenbecker Engineering Polska",
                "br_time": "08.2018: ",
                "br_name": "Bernecker&Rainer",
                "br_title": "Bernecker&Rainer",
                "abis_time": "07.2018: ",
                "abis_name": "Abis sp.z.o.o"
            },
            "education": {
                "header": " Education:",
                "agh_2_time": " 02.2018 - 04.2021",
                "agh_2_name": " University of science and technology in Cracow - Automation and Metrology II degree",
                "agh_1_time": " 10.2015 - 02.2018",
                "agh_1_name": " University of science and technology in Cracow - Automation and Metrology I degree",
                "zs6_time": " 10.2011 - 04.2015",
                "zs6_name": " Technical Secondary School No. 4 in Jastrzebie-Zdrój - Mechatronics",
                "agh_title": "University of science and technology in Cracow",
                "zs6_title": "School Complex No. 6 for them. King Jan III Sobieski"
            },
            "contact": {
                "header": "Contact details:",
                "mail_label": "Email: ",
                "mail": "kotlinski95@gmail.com",
                "phone_label": "Phone number: ",
                "phone": "+48 608 418 911"
            },
            "hobby": {
                "header": "Hobbies:",
                "running": "Running",
                "music": "Music",
                "coding": "Programming",
                "films": "Films"
            }

        },
        "aboutme": {
            "main" : {
                "header": "About me",
                "text": "My name is Adrian Kotliński, I live in Katowice. I studied Automation and Robotics at the AGH University of Science and Technology in Krakow. I'm a web development adept, constantly looking for new challenges in this area. I love minimalist design and subtle animations. I want to develop in technologies related to TypeScript and React, this page was created for the purposes of self-education in this area.",
                "see_myprofile": "For more, see my profile",
                "education_header": "Education process",
                "education_text": "I started to be interested in programming in general already around 2014. At the end of the technical school, I already knew that I wanted to connect my future with it. During my studies, I learned many interesting programming languages, initially I focused my path on industrial automation and application programming in the automotive industry, which was directly related to my study profile",
                "education_course": "At the end of 2020, I changed my direction to web development. I joined the ",
                "education_continue": " ,which is a remote web programming course, thanks to which I learned many basics allowing me to create independent projects. This is where I first came into contact with React. I also learned a lot of good programming practices there. In the meantime, I also participated in the nationwide remote coders camp programming course, where I learned about JavaScript, TypeScirpt, React and NodeJS for a period of 5 months. I finished this course in April 2020, and since then I have been continuing my independent studies every day. I not only consolidate the knowledge I have gained so far, but also learn new solutions and technologies.",
                "see_education": "More about my education",
                "see_courses": "More about my courses",
                "see_easycode": "Easy-Code ",
                "personality_header": "Personality",
                "personality_text": "A bit about me - I'm a calm and ambitious person. I love working in a team and learning new things. I'm not afraid of challenges, on the contrary - I'm constantly looking for them. Solving problems on your own is, in my opinion, the best way to learn.",
                "see_blog": "More about me in my blog",
                "experience_header": "Experience",
                "experience_text": "I started my programming career in 2018, where during my studies I worked as a programmer of automotive control systems on many foreign projects. Experience on foreign projects has significantly raised my level of English. I have no problems with understanding the documentation or communication. From December 2020, I started gaining my first experience as a web developer. I am currently working as a junior front-end developer, dealing with the development of online stores on the shopify platform. This work significantly raised my level of knowledge about the IT environment, teamwork, Agile and Scrum methods, Git support and, above all, web programming.",
                "see_experience_plc": "More about my PLC programming experience",
                "see_experience_web": "More about my Web-developer carrier",
                "contact": "Contact",
                "contact_text": "Feel free to contact me, whether it's about work or a casual conversation. I will be happy to reply to any message I receive. ",
                "see_contact": "Go to the contact form"
            },
            "front": {
                "header": "Web developer career",
                "text" : "My name is Adrian Kotliński, I started my career with web development in September 2020. I have been programming for many years, but the front end track is relatively new to me. I'm constantly getting to know this world and trying to improve my skills in this area.",
                "back_to_home": "More about me",
                "sobre": {
                    "header": "Sobre Software House",
                    "text": "In April 2021, I started working for Sobre Software House as a web developer. I work mainly in the e-commerce industry as a junior Shopify Developer, co-creating software for online stores commissioned by Reckitt.",
                    "link": "https://www.sobre.pl/",
                    "link_label": "More about Sobre"
                },
                "easy_code": {
                    "header": "Easy Coder",
                    "text": "In December 2020, I started my first job as a junior Front-End Developer at Easy Coder Piotr Mirosz, it was the first opportunity to learn about working as a web developer. For the next 4 months I worked, among others, on e-commerce projects in Shopify, I also co-created web applications in React and Next JS.",
                    "text_ace": "Currently, the company is recognized under the name ACE Agency. In April 2021, I was transferred from the ACE Agency to Sobre Software House",
                    "link": "https://ace-agency.co/",
                    "link_label": "More about ACE Agency"
                }
            },
            "plc": {
                "header": "PLC Programming career",
                "text": "I spent the first years of my work as a programmer mainly in the position of Automatic Engineer, where I dealt with the programming of industrial controllers. This field is particularly close to me and directly related to my education. Currently, I'm constantly striving to improve my programming skills, but I'm more focused on the field of web development. As an Automation Engineer and PLC programmer, I dealt with programming controllers from Siemens, Allen Bradley, B&R, Mitsubishi in LAD, ST, SCL, C, C ++",
                "back_to_home": "More about me",
                "blumenbecker": {
                    "header": "Blumenbecker Engineering Polska",
                    "text": "In this company, I worked as a Control Systems Programmer in the automotive industry. I dealt with the implementation of automated industrial lines in car factories. This job was associated with frequent trips abroad, which allowed me to improve my language skills (mainly English). I worked mainly with the VASS standard (for the VW group) as a programmer of Siemens controllers and SEW servo drives.",
                    "link": "https://www.blumenbecker.com/pl/firma/grupy-blumenbecker/blumenbecker-engineering-polska-sp-z-oo",
                    "link_label": "More about Blumenbecker Engineering Polska"
                },
                "bernecker": {
                    "header": "Bernecker&Rainer",
                    "text": "In this company, I completed an internship related to PLC programming from B&R and ACOPOS servo drives in the Automation Studio environment. I have worked with languages ​​such as ST, C, C ++, which allow the use of high-level programming languages ​​to control industrial applications.",
                    "link": "https://www.br-automation.com/pl/o-nas/",
                    "link_label": "More about Bernecker&Rainer"
                }
            },
            "courses": {
                "header": "Courses and training",
                "text": "The field of programming is about continuous improvement of my skills, so I started my adventure with web development by participating in two programming courses.",
                "back_to_home": "More about me",
                "easy_code": {
                    "header": "Easy Code",
                    "text": "This course covers a very wide range of topics from the world of the Front-End. Here I learned the basics of web development (HTML, CSS, JavaScript), but also delved into the secrets of TypeScript and ReactJS. These skills allowed me to get my first job offer and the possibility of further development in this field.",
                    "link": "https://easy-code.io/blog/article/5Jn92JIZDad91IxGqs3m6c",
                    "link_label": "More about Easy Code"
                },
                "coders_camp": {
                    "header": "Coders Camp",
                    "text": "I joined the Coders Camp course in its sixth edition, which was its first all-Poland remote edition. The subject of the course included a review of the basics (HTML, CSS), knowledge of which was checked during recruitment tests. Later in the course, theoretical and practical knowledge of the following topics was tested: JavaScript, TypeScript, React JS and Node JS.",
                    "link": "https://coderscamp.edu.pl/",
                    "link_label": "More about Coders Camp"
                }
            },
            "education": {
                "header": "Education",
                "text": "For many years I have been passionate about programming, electronics and technical innovations. This is why I chose the Mechatronics Technical School as my secondary school, which combined all these areas. I chose a narrower specialization in the area of ​​Industrial Automation for my studies. Now, after many years of experience, gained experience and skills, I want to focus on web programming.",
                "back_to_home": "More about me",
                "agh": {
                    "header": "MSc. Automation and Robotics",
                    "text": "I studied Automation and Robotics at AGH in Krakow, during 11 semesters I gained many skills that I can successfully use as a programmer. During the classes, I not only developed my programming skills, but also analytical thinking, logic, algorithmics and the theory of control and automation.",
                    "link": "https://www.imir.agh.edu.pl/pl/studia/kierunki/automatyka_i_robotyka/",
                    "link_label": "More about Automation and Robotics at AGH"
                },
                "zs6": {
                    "header": "Mechatronics technician",
                    "text": "The field of Mechatronics Technician at the School Complex No. 6 in Jastrzbie-Zdrój turned out to be a very good choice to gain technical skills and go beyond the program offered in the general secondary school. This is the place where I gained my first experience with programming languages ​​such as C, C ++ and industrial controllers programming skills.",
                    "link": "https://zs6sobieski.pl/rekrutacja/rekrutacja-technikum-nr-4/technikum-nr-4-profile-zawodow/technik-mechatronik/",
                    "link_label": "More about the Mechatronics technician major in ZS6"
                }
            }
        },
        "cv": {
            "link": "CV / Overview"
        },
        "services": {
            "buttonText" : "More",
            "popup": {
                "title": "Information!",
                "text": "I'm currently working on a description of service packages. If I haven't finished yet, feel free to write to me or call me to find out more.",
                "buttonText": "I understand"
            },
            "web": {
                "header": "Web development",
                "text": "Creating web applications",
                "link": "/services/web-development",
                "inner": {
                    "header1": "SPA / Apps and online stores",
                    "text1": "Creating the entire client layer of a web application or selected components based on the ReactJS library, HTML5, CSS3, ES6 / TypeScript.",
                    "header2": "Adaptation to different browsers and devices",
                    "text2": "Adapting the website to selected browsers and mobile devices, taking into account different resolutions (the so-called Responsive Web Design).",
                    "header3": "Coding PSD to HTML / CSS / JS",
                    "text3": "Cutting and coding to HTML5, CSS3 and JavaScript provided graphic design of a website, web applications and others.",
                    "header4": "Clean code",
                    "text4": "The readability of the code is still considered a trivial matter, but unreadable code significantly increases the time it takes to write anything and can lead to unforeseen errors in your applications.",
                    "header5": "Website administration",
                    "text5": "Implementation and maintenance of the website / web application, including periodic reports on automatic and manual tests of selected functionalities.",
                    "header6": "JavaScript / TypeScript",
                    "text6": "As a web developer, I work with JavaScript / TypeScript, in order to extend the range of services offered, I can undertake any project using these technologies."
                }
            },
            "shopify": {
                "header": "E-commerce Shopify",
                "text": "Create online stores using Shopify",
                "link": "/services/shopify",
                "inner": {
                    "header1": "Create unique store templates",
                    "text1": "Each store should stand out from the rest. I will make personalized templates tailored to the client so that the user-experience effect is at the highest level.",
                    "header2": "Store optimization",
                    "text2": "I make sure that the template meets all SEO requirements and that the store runs smoothly and quickly.",
                    "header3": "Shopping on any device",
                    "text3": "Currently, more and more users use mobile devices when shopping. I take care of the proper functioning of the store also on all mobile devices."
                }
            },
            "plc": {
                "header": "PLC",
                "text": "Programowanie sterowników przemysłowych",
                "link": "/services/PLC",
                "inner": {
                    "inner": {
                        "header1": "PLC programming",
                        "text1": "I have several years of experience in programming industrial controllers from Siemens, Bernecker & Rainer and Mitsubishi.",
                        "header2": "Commissioning of automation objects",
                        "text2": "I have worked on commissioning in several automotive factories in Poland and in Niemczec. I am familiar with process technology, drive control and visualization.",
                        "header3": "Smart Home Applications",
                        "text3": "I'm a fan of DIY and electrics, I will be happy to take on the challenges of creating Smart Home Applications (due to the possibility of creating smart applications in JavaScript, I will be happy to develop my skills in this area)."
                    }
                }
            }
        }
    },
    "contact_popup": {
        "title": "Hello",
        "text": "Feel free to contact me:"
    }
}